# SpaceCavityRatio Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Space..::..SpaceCavityRatio Property
Space Class See Also
---
Get the Space Cavity Ratio of the Space.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double SpaceCavityRatio { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SpaceCavityRatio As Double
	Get
```

Visual C++
---
```text
public:
property double SpaceCavityRatio {
	double get ();
}
```

# Remarks
This property is used to get the Space Cavity Ratio of the Space.
# See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace